app/controllers/characters_controller.rb

  def index
    @characters = Character.find_all
---
SELECT "characters".* FROM "characters"