app/controllers/characters_controller.rb

  def show
    @character = Character.find(params[:id])
---
SELECT "characters".* FROM "characters" WHERE "characters"."character_id" = 1009398 ORDER BY "characters"."id" ASC LIMIT 1